tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
tap "ubuntu/microk8s"
# GNU database manager
brew "gdbm"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# YAML Parser
brew "libyaml"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Engine for large-scale data processing
brew "apache-spark"
# High performance message passing library
brew "open-mpi"
# Routines to solve large scale eigenvalue problems
brew "arpack"
# GNOME accessibility toolkit
brew "atk"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli", link: false
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Configurable talking characters in ASCII art
brew "cowsay"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc@7"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Improved top (interactive process viewer)
brew "htop"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv", link: false
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Enable trim for SSD performance
cask "trim-enabler"
cask "alfred"
cask "hiddenbar"
cask "google-chrome"
cask "visual-studio-code"
